#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```
module.saml-app.okta_app_saml.saml_app["deserthomescleaning.com"]: Refreshing state... [id=0oa3jh92glUBcTYNH5d7]
google_project_iam_member.rolemapping["user:test2@deserthomescleaning.com-deserthomescleaning.com-roles/iam.workloadIdentityPoolAdmin-782936128004"]: Refreshing state... [id=782936128004/roles/iam.workloadIdentityPoolAdmin/user:test2@deserthomescleaning.com]
google_project_iam_member.rolemapping["user:test2@deserthomescleaning.com-deserthomescleaning.com-roles/cloudjobdiscovery.admin-782936128004"]: Refreshing state... [id=782936128004/roles/cloudjobdiscovery.admin/user:test2@deserthomescleaning.com]
google_project_iam_member.rolemapping["user:test2@deserthomescleaning.com-deserthomescleaning.com-roles/owner-782936128004"]: Refreshing state... [id=782936128004/roles/owner/user:test2@deserthomescleaning.com]
module.saml-app.okta_app_user.user_assignments["deserthomescleaning.com-test2@deserthomescleaning.com"]: Refreshing state... [id=00u3hyo5edWi9WbdV5d7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_iam_member.rolemapping["user:test@deserthomescleaning.com-deserthomescleaning.com-roles/owner-782936128004"] will be created
  + resource "google_project_iam_member" "rolemapping" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "user:test@deserthomescleaning.com"
      + project = "782936128004"
      + role    = "roles/owner"
    }

  # module.saml-app.okta_app_user.user_assignments["deserthomescleaning.com-test@deserthomescleaning.com"] will be created
  + resource "okta_app_user" "user_assignments" {
      + app_id              = "0oa3jh92glUBcTYNH5d7"
      + has_shared_username = (known after apply)
      + id                  = (known after apply)
      + retain_assignment   = false
      + user_id             = "00u3jhvgcsexZxvth5d7"
      + username            = "test@deserthomescleaning.com"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "google_workspace_pass"
│ but a value was found in file
│ "/github/workspace/staging/accounts/google-cloud/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "vault_google_workspace_password_path" but a value was found in file
│ "/github/workspace/staging/accounts/google-cloud/../../../common.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 10 other variable(s)
│ defined without being declared.
╵

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2022-01-09T08:54:28Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt Google-Cloud App`, Action: `__the-commons-project_terragrunt-github-actions_4`, Working Directory: `./staging/accounts/google-cloud/`, Workspace: `default`*
